In [200]:
import pandas as pd
import numpy as np
import ast

In [201]:
import pymysql
import sqlalchemy as alch

In [202]:
import os
from dotenv import load_dotenv 
load_dotenv()

True

In [203]:
sql_password = os.getenv("SQL_password")

In [135]:
movies = pd.read_csv("../data/movies.csv", index_col=0)

In [136]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7279 entries, 0 to 7634
Data columns (total 21 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   title                       7279 non-null   object
 1   year                        7279 non-null   int64
 2   bt_score                    7279 non-null   int64
 3   dubious                     7279 non-null   int64
 4   imdbid                      7279 non-null   int64
 5   tmdbId                      7279 non-null   int64
 6   genres                      7279 non-null   object
 7   popularity                  7279 non-null   float64
 8   production_companies        7279 non-null   object
 9   production_countries        7279 non-null   object
 10  release_date                7279 non-null   object
 11  revenue                     7279 non-null   float64
 12  vote_average                7279 non-null   float64
 13  vote_count                  7279 non-null   float64
 14  cast                        7279 non-null   object
 15  crew                        7279 non-null   object
 16  budget                      7279 non-null   float64
 17  cast_gender                 7279 non-null   object
 18  crew_gender                 7279 non-null   object
 19  cast_female_representation  7279 non-null   float64
 20  crew_female_representation  7279 non-null   float64
dtypes: float64(7), int64(5), object(9)
memory usage: 1.2+ MB

In [47]:
movies.sample(4)

,title,year,bt_score,dubious,imdbid,tmdbId,genres,popularity,production_companies,production_countries,release_date,revenue,vote_average,vote_count,budget,cast_gender,crew_gender,cast_female_representation,crew_female_representation
7015,The House Is Black,1963,0,0,336693,44065,['Documentary'],4.815,['Studio Golestan'],['Iran'],01/01/1963,0.0,7.5,96.0,0.0,"[1, 2, 2]","[2, 1, 1, 1, 2]",33.333333,60.000000
7475,Monsters,2010,0,0,1470827,43933,"['Drama', 'Thriller', 'Science Fiction']",11.723,"['Vertigo Films', 'Protagonist Pictures']",['United Kingdom'],18/06/2010,5639730.0,6.2,1273.0,500000.0,"[2, 1, 0, 1, 0, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, ...","[2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 0, 0, ...",4.081633,4.285714
2145,C.R.A.Z.Y.,2005,3,1,401085,11421,"['Drama', 'Comedy']",8.204,"['Téléfilm Canada', 'Cirrus Communications', '...","['Canada', 'Morocco']",27/05/2005,3692417.0,7.5,349.0,0.0,"[2, 1, 2, 2, 2, 2, 1, 2, 1, 1, 2, 1, 2, 2, 2, ...","[2, 2, 2, 2, 0, 0, 2, 0, 0, 2, 2, 1, 2]",24.324324,7.692308
1054,My Girl,1991,3,0,102492,4032,"['Comedy', 'Drama']",19.742,"['Columbia Pictures', 'Imagine Entertainment']",['United States of America'],27/11/1991,59489799.0,7.4,1672.0,17000000.0,"[1, 2, 2, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2, 2, 0, ...","[2, 2, 0, 1, 2, 1, 1, 2, 0, 0, 2, 0, 1]",33.333333,30.769231

- **bt_score** : The bechdel test score. <br>
    0: Failed the test :( <br>
    1: It has to have at least two named women in it.<br>
    2: Who talk to each other.<br>
    3: About something besides a man.
    
- **dubious**: Whether the submitter considered the rating dubious.

- **imdbid**: id on IMDb 

- **tmdbId**: id on TMDB

- **popularity**: TMDB popularity.

- **revenue**: revenue in American Dollar (USD). Not adjusted for inflation.

- **vote_average**: average rating

- **vote_count**: number of ratings
    
- **cast and crew**: a json with cast and crew information. Check the response body in the TMDB api docs.

- **cast_gender and crew_gender**: gender of cast and crew.<br>
    0: Not specified;<br>
    1: Female;<br>
    2: Male;<br>
    3: Non-binary.
    
- **cast_female_representation** and **crew_female_representation**: percentage of women (1) in the cast or crew.

In [11]:
# nuove colonne: regista, produttore

In [48]:
#set(movies["release_date"])

In [18]:
movies[~movies["release_date"].str.contains(r'\d{2}/\d{2}/\d{4}')]["release_date"]

Series([], Name: release_date, dtype: object)

In [115]:
movies.drop(columns=['crew','cast'], inplace=True)

In [204]:
all_movies=pd.read_csv("../data/all_movies.csv", index_col=0)
all_movies

,title,year,bt_score,dubious,imdbid,tmdbId,genres,popularity,production_companies,production_countries,release_date,revenue,vote_average,vote_count,budget,cast_gender,crew_gender,cast_female_representation,crew_female_representation
0,Cinderella,1899.0,3.0,0.0,230.0,114108.0,"['Drama', 'Family', 'Fantasy', 'Romance']",3.762,"['Star-Film', 'Georges Méliès']",['France'],01/10/1899,0.0,6.100,79.0,0.0,"[2, 0, 1, 0, 1, 0]","[2, 2, 2, 2]",33.333333,0.000000
1,Gretchen the Greenhorn,1916.0,3.0,0.0,6745.0,126925.0,[],1.942,[],[],03/09/1916,0.0,6.100,7.0,0.0,"[1, 2, 2, 2]","[2, 2, 2]",25.000000,0.000000
2,Snow White,1916.0,3.0,0.0,7361.0,174598.0,"['Fantasy', 'Drama']",0.817,[],[],24/12/1916,0.0,5.700,9.0,0.0,"[0, 1, 2, 2, 0]",[2],20.000000,0.000000
3,The Poor Little Rich Girl,1917.0,3.0,0.0,8443.0,95866.0,"['Romance', 'Comedy', 'Drama', 'Fantasy']",2.023,['Artcraft Pictures Corporation'],['United States of America'],05/03/1917,0.0,5.800,23.0,0.0,"[1, 0, 0, 0, 2, 0, 1, 1, 0, 2, 0, 1, 1]","[2, 2, 1, 1, 2, 2, 0]",38.461538,28.571429
4,Stella Maris,1918.0,3.0,0.0,9652.0,70753.0,['Drama'],1.310,['Mary Pickford Company'],['United States of America'],21/01/1918,2400000.0,6.900,19.0,0.0,"[1, 1, 2, 2, 1, 0, 0, 2]","[1, 2, 2, 0, 2, 2]",37.500000,16.666667
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7879,Me Time,2022.0,1.0,0.0,14309446.0,NaN,['Comedy'],32.523,"['Particular Pictures', 'HartBeat Productions']",NaN,26/08/2022,0.0,5.927,770.0,0.0,"[2, 2, 1, 2, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1, 2, ...","[1, 2, 2, 2, 1, 2, 2, 2, 1, 0, 2, 1, 1, 2, 0, ...",25.806452,29.411765
7880,My Policeman,2022.0,2.0,0.0,13139228.0,NaN,"['Drama', 'Romance']",18.508,"['Amazon Studios', 'Berlanti Productions', 'In...",NaN,20/10/2022,0.0,7.764,592.0,0.0,"[2, 3, 2, 1, 2, 2, 2, 1, 2, 2, 2, 2, 2, 1, 0, ...","[1, 2, 2, 0, 2, 1, 0, 2, 2, 0, 0, 2, 1, 2, 2, ...",17.391304,9.375000
7881,Enola Holmes 2,2022.0,3.0,0.0,14641788.0,NaN,"['Adventure', 'Mystery', 'Crime']",37.480,"['Legendary Pictures', 'PCMA Productions']",NaN,04/11/2022,0.0,7.536,2206.0,0.0,"[1, 2, 2, 2, 1, 2, 1, 1, 1, 0, 2, 1, 1, 0, 2, ...","[2, 1, 1, 2, 0, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, ...",14.285714,16.216216
7882,Fire Island,2022.0,3.0,0.0,15218000.0,NaN,"['Comedy', 'Romance']",14.970,"['Jax Media', 'Searchlight Pictures']",NaN,09/06/2022,0.0,7.162,195.0,10000000.0,"[2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, ...","[2, 1, 2, 2, 0, 0, 2, 2, 2, 0, 2, 1, 2, 0, 0, ...",10.714286,10.937500
7883,"Man From Toronto, The",2022.0,2.0,0.0,11671006.0,NaN,"['Action', 'Adventure', 'Comedy']",30.470,"['Escape Artists', 'Sony Pictures', 'Bron Stud...",NaN,23/12/2022,0.0,6.487,233.0,75000000.0,"[2, 2, 1, 1, 1, 2, 2, 1, 2, 2, 2, 1, 2, 2, 2, ...","[2, 1, 2, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, ...",15.686275,13.333333

In [181]:
all_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7884 entries, 0 to 7883
Data columns (total 19 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   title                       7884 non-null   object
 1   year                        7884 non-null   float64
 2   bt_score                    7884 non-null   float64
 3   dubious                     7884 non-null   float64
 4   imdbid                      7884 non-null   float64
 5   tmdbId                      7271 non-null   float64
 6   genres                      7884 non-null   object
 7   popularity                  7884 non-null   float64
 8   production_companies        7884 non-null   object
 9   production_countries        7271 non-null   object
 10  release_date                7884 non-null   object
 11  revenue                     7884 non-null   float64
 12  vote_average                7884 non-null   float64
 13  vote_count                  7884 non-null   float64
 14  budget                      7884 non-null   float64
 15  cast_gender                 7884 non-null   object
 16  crew_gender                 7884 non-null   object
 17  cast_female_representation  7884 non-null   float64
 18  crew_female_representation  7884 non-null   float64
dtypes: float64(12), object(7)
memory usage: 1.2+ MB

In [ ]:
#dataframe per producing companies
'''
imbdid (pk)
title
release_year
producing_company
budget
bt_score       
dubious 
'''

In [206]:
type(all_movies["production_companies"][0])

str

In [207]:
#creating a dataframe for production companies
production_companies_lst=[]
for index, row in all_movies.iterrows():
    # "production_companies" is stored as a string representation of a list, i had to convert it into a list first
    production_companies_list = ast.literal_eval(row["production_companies"])
    for el in production_companies_list:
        movie_dict = {}
        movie_dict["imdbid"] = row["imdbid"]
        movie_dict["title"] = row["title"]
        #movie_dict["year"] = row["year"]
        movie_dict["production_company"] = el
        #movie_dict["bt_score"] = row["bt_score"]
        #movie_dict["dubious"] = row["dubious"]
        #movie_dict["budget"] = row["budget"]
        production_companies_lst.append(movie_dict)

production_companies = pd.DataFrame(production_companies_lst)

In [208]:
production_companies.sample(10)

,imdbid,title,production_company
11197,2261287.0,Ballerina,Caramel Films
7458,1411238.0,No Strings Attached,The Montecito Picture Company
2631,119173.0,G.I. Jane,Moving Pictures
7117,1255953.0,Incendies,Phi Group
14479,72308.0,The Towering Inferno,Warner Bros. Pictures
18355,1376213.0,The Adventurer: The Curse of the Midas Box,uFilm
6792,1209377.0,Beautiful Kate,Doll Australia
5963,1069238.0,Departures,dentsu
14032,32910.0,Pinocchio,Walt Disney Productions
22055,3907584.0,All the Bright Places,Echo Lake Entertainment

In [184]:
# dataframe per cast gender

In [185]:
cast_lst=[]
for index, row in all_movies.iterrows():
    movie_dict = {}
    movie_dict["imdbid"] = row["imdbid"]
    movie_dict["title"] = row["title"]
    #movie_dict["bt_score"] = row["bt_score"]
    movie_dict["female_cast_count"]=0
    movie_dict["male_cast_count"]=0
    movie_dict["nonbinary_cast_count"]=0
    cast_gender_lst = ast.literal_eval(row["cast_gender"])
    for el in cast_gender_lst:
        if el==1:
            movie_dict["female_cast_count"]+=1
        elif el==2:
            movie_dict["male_cast_count"]+=1
        elif el==3:
            movie_dict["nonbinary_cast_count"]+=1
    movie_dict["num_actors"]=len(cast_gender_lst)
    cast_lst.append(movie_dict)

cast = pd.DataFrame(cast_lst)

In [186]:
#dataframe per crew gender
crew_lst=[]
for index, row in all_movies.iterrows():
    movie_dict = {}
    movie_dict["imdbid"] = row["imdbid"]
    movie_dict["title"] = row["title"]
    #movie_dict["bt_score"] = row["bt_score"]
    movie_dict["female_crew"]=0
    movie_dict["male_crew"]=0
    movie_dict["nonbinary_crew"]=0
    crew_gender_lst = ast.literal_eval(row["crew_gender"])
    for el in crew_gender_lst:
        if el==1:
            movie_dict["female_crew"]+=1
        elif el==2:
            movie_dict["male_crew"]+=1
        elif el==3:
            movie_dict["nonbinary_crew"]+=1
    movie_dict["num_crew"]=len(crew_gender_lst)
    crew_lst.append(movie_dict)

crew = pd.DataFrame(crew_lst)

In [187]:
crew

,imdbid,title,female_crew,male_crew,nonbinary_crew,num_crew
0,230.0,Cinderella,0,4,0,4
1,6745.0,Gretchen the Greenhorn,0,3,0,3
2,7361.0,Snow White,0,1,0,1
3,8443.0,The Poor Little Rich Girl,2,4,0,7
4,9652.0,Stella Maris,1,4,0,6
...,...,...,...,...,...,...
7879,14309446.0,Me Time,5,8,0,17
7880,13139228.0,My Policeman,18,25,0,192
7881,14641788.0,Enola Holmes 2,12,19,0,74
7882,15218000.0,Fire Island,7,25,2,64
7883,11671006.0,"Man From Toronto, The",10,33,0,75

In [ ]:
# SAVE TO SQL

In [188]:
dbName = "women_representation"

In [189]:
connectionData = f"mysql+pymysql://root:{sql_password}@localhost/{dbName}"

In [190]:
engine = alch.create_engine(connectionData)

In [191]:
all_movies.to_sql("movies", if_exists="append", con=engine, index=False)

7884

In [192]:
production_companies.to_sql("production_companies", if_exists="append", con=engine, index=False)

23505

In [193]:
cast.to_sql("cast", if_exists="append", con=engine, index=False)

7884

In [194]:
crew.to_sql("crew", if_exists="append", con=engine, index=False)

7884

In [195]:
engine.execute('''
ALTER TABLE movies
ADD PRIMARY KEY (imdbid);
''')

engine.execute('''
ALTER TABLE cast
ADD PRIMARY KEY (imdbid);
''')

engine.execute( '''
ALTER TABLE crew
ADD PRIMARY KEY (imdbid);
''');

In [196]:
engine.execute('''
ALTER TABLE production_companies
ADD FOREIGN KEY (imdbid)
REFERENCES movies(imdbid)
''');

engine.execute('''
ALTER TABLE crew
ADD FOREIGN KEY (imdbid)
REFERENCES movies(imdbid)
''');

engine.execute('''
ALTER TABLE cast
ADD FOREIGN KEY (imdbid)
REFERENCES movies(imdbid)
''');